{
  "id": 0,
  "messages": {
    "en": {
      "title": "Important! The official 3WiFi server not available",
      "message": "The official 3WIFI server is no longer working and it's unclear whether it can be restored or if a new official server will be created. \n\nHowever, you can still use third-party servers with their own databases or set up your own server using source code from GitHub. \n\nAll offline features of the app are working, including offline WPS pin generators and an offline database directly in the app, where you can upload your myuploads.txt file from the 3WiFi site or load scans from RouterScan.\n\nP.S.\nI will now focus on offline features and improving the database in the app. Maybe I'll try to add a WiFi map to the app later. Or maybe I'll completely rewrite the app from scratch. Who knows, if a big part of the official database was leaked, perhaps the app will someday have the entire 3WiFi database and you could use a large external database file from your phone's memory with indexing. And we would get an open source hybrid of a 3WiFi locator, WiFi analyzer and WiFi map."
    },
    "ru": {
      "title": "Важно! Официальный сервер 3WiFi недоступен",
      "message": "Официальный сервер проекта 3WIFI больше не работает, и неизвестно, смогут ли его восстановить или будет ли создан новый официальный сервер. Последнии новости о официальном сервере можете найти на официальном телеграм канале. \n\nОднако вы всё также можете использовать сторонние сервера с их собственной базой данных или можете поднять свой сервер из исходников на GitHub. \n\nТакже работают все офлайн функции приложения, офлайн-генераторы WPS пин-кодов, офлайн БД прямо в приложении, в которую вы можете выгрузить свой файл myuploads.txt с сайта 3WiFi или же загружать в неё сканы с RouterScan.\n\nP.S.\nСейчас постараюсь сконцентрироваться на офлайн функциях и улучшении БД в приложении. Может быть, попробую добавить потом карту WiFi-точек в приложении. Или вообще полностью с нуля перепишу приложение. Ведь кто знает, если действительно большая часть официальной БД была слита, возможно в приложении однажды будет целиком БД 3WiFi, можно будет использовать большой внешний файл БД из памяти телефона с индексацией. И мы получим опенсорсный гибрид 3WiFi локатора, WiFi анализатора и WiFi map."
    }
  }
}
